** 41
   #+begin_src cpp
     #include <iostream>
     #include <vector>
     #include <algorithm>

     using namespace std;

     int func(vector<int> v) {
       int s = v.size();
       vector<pair<int, int>> d(s);
       d[s-1].second = 0;
       d[0].first = v[0];
       for (int i = 1; i < s; ++i)
         d[i].first = (d[i-1].first > 0 ? d[i-1].first + v[i] : v[i]);
       for (int i = s - 2; i >= 0; --i)
         d[i].second = (d[i+1].second + v[i+1] > 0 ? d[i+1].second + v[i+1] : 0);
       for_each(d.begin(), d.end(), [](pair<int, int> x){cout << x.first << " " << x.second << endl;});
       vector<int> r;
       transform(d.begin(), d.end(), back_inserter(r), [](pair<int, int> x) ->int {return x.first + x.second;});
       return *max_element(r.begin(), r.end());
     }

     int main() {
       vector<int> v {1, -2, 3, 10, -4, 7, 2, -5};
       cout << func(v) << endl;
       return 0;
     }
   #+end_src

    #+RESULTS:
    |  1 | 16 |
    | -1 | 18 |
    |  3 | 15 |
    | 13 |  5 |
    |  9 |  9 |
    | 16 |  2 |
    | 18 |  0 |
    | 13 |  0 |
    | 18 |    |
